Tekla Open API Reference for Tekla Structures 2025
IEvents.OnUndoClicked Method
 Called when user clicks undo.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
void OnUndoClicked()
Sub OnUndoClicked
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace